REGIATER_SUCCESS = """
درخواست شما برای ایجاد حساب کاربری با موفقیت ثبت شد 🎉

در صورت پرداخت هزینه اشتراک ماهیانه 🎁 اکانت اختصاصی شما از همین طریق برای شما ارسال خواهد شد 🍻
"""
REGISTER_ADMIN_ALERT = """
{} with Chat ID <code>{}</code> has requested to create a VPN user acoount.
"""
WELCOME_MESSAGE = """
سلام دوست عزیز 👋

از طریق این ربات می توانید در هر لحظه اقدام به خرید سرویس VPN جدید نمایید.

همچنین از طریق منوی زیر می توانید به اطلاعات پروفایل و وضعیت سرویس های خریداری شده خود دسترسی داشته باشید.

 📣 [کانال تلگرام](https://t.me/EloraVPNChannel/73)

"""

PLEASE_SUBSCRIBE_MESSAGE = """
سلام دوست عزیز 👋

📌 لطفا برای تجربه بهتر استفاده از ربات، اطلاع رسانی ها و همچنین تخفیف در کانال ما عضو شوید.

👈🏻 پس از عضویت روی دکمه ( ✅ عضو شدم ) کلیک کنید
"""

MY_ACCOUNT_MESSAGE = """
 وضعیت اشتراک: <code>{}</code>
 شناسه سرویس: <code>{}</code>
 بسته فعلی: <code>{}</code>
 نام سرویس: <code>{}</code>

⏰ تاریخ اعتبار : <code>{}</code>

شما تاکنون <code>{}</code> از <code>{}</code>، معادل <code>{}</code> درصد ترافیک سرویس خود را مصرف نموده اید.

⚠️ از ارسال این لینک در پیامک یا پیام رسان های داخلی خودداری نمایید، زیرا باعث غیرفعال شدن اکانت شما خواهد شد.

روی متن زیر کلیک نمایید تا لینک اشتراک پروفایل شما در کلیپ بورد کپی شود: 
 
 <code>{}/{}</code>
"""

ACCOUNT_LIST_MESSAGE = """

 ✳️ در این قسمت لیست سرویس های شما قابل مشاهده می باشد.
 
 شما می توانید پس از کلیک روی نام هر سرویس لینک اشتراک را مشاهده نمایید.
 همچنین می توانید اقدام به تمدید یا رزرو سرویس نمایید.
 
 👈 جهت دسترسی به جزییات هر سرویس روی نام آن کلیک نمایید:

"""

NO_ACCOUNT_MESSAGE = """
شما سرویس فعالی ندارید، لطفا از قسمت خرید سرویس اقدام به خرید یک سرویس نمایید.
"""

NOT_IMPLEMENTED = """

این امکان بزودی اضافه خواهد شد.


"""

PAYMENT_MESSAGE = """

موجودی فعلی شما: {balance}

⚠️ قبل از پرداخت، تعرفه سرویس ها در منوی خرید سرویس را مشاهده نمایید.

1️⃣ لطفا مبلغ مورد نظر خود را به شماره کارت زیر واریز نمایید.
 
2️⃣ رسید پرداخت را با استفاده از دکمه ارسال رسید و فقط در قالب تصویر در پایین همین پیام برای ما ارسال نمایید.

3️⃣ پس از افزایش موجودی حساب می توانید از طریق منوی خرید سرویس اقدام نمایید.

<code>{card_number}</code>

به نام: {card_owner}

<a href="https://t.me/EloraVPNChannel/73">📣 کانال تلگرام</a>

"""

BUY_NEW_SERVICE_HELP = """
🛍 شما در حال خرید یک سرویس جدید هستید.

⚠️ توجه نمایید اگر مایل به تمدید یا رزرو برای یکی از سرویس های فعلی خود هستید، از منوی سرویس های من اقدام نمایید.

لطفا یکی از سرویس های زیر را جهت خرید انتخاب نمایید:
"""

RECHARGE_SERVICE_HELP = """
شما می توانید یکی از سرویس های زیر را جهت تمدید یا رزرو
لطفا یکی از سرویس های زیر را جهت تمدید(رزرو) سرویس انتخابی فعلی انتخاب نمایید:
"""

USAGE_HELP_MESSAGE = """
⚠️ از ارسال لینک اشتراک در پیامک یا پیام رسان های داخلی خودداری نمایید، زیرا باعث غیرفعال شدن اکانت شما خواهد شد.

لطفا تمامی مراحل موجود در کلیپ های آموزشی را با دقت انجام دهید تا بهترین سرعت را دریافت نمایید.

سرویس VPN را روی چه دستگاهی می خواهید استفاده نمایید؟


"""

PRICE_LIST = """
جهت مشاهده لیست تعرفه سرویس روی منوی خرید سرویس ضربه بزنید.
"""

MY_PROFILE = """
👤 کاربر: {full_name}

✳️ شناسه کاربری: {user_id}

💰 موجودی حساب شما: <code>{balance}</code> تومان

👥 تعداد زیر مجموعه فعال: {referral_count} نفر

🚀 لینک دعوت از دوستان:
<code>https://t.me/{bot_user_name}?start={user_id}</code> 

👈 با ضربه زدن روی لینک بالا، لینک کپی خواهد شد.

🎉 با ارسال این لینک برای دوستان و آشنایان خود و عضویت آنها در کانال ما، اعتبار خرید هدیه دریافت کنید.

 🥉 همچنین در صورت خرید هر یک از زیر مجموعه های شما، بخشی از مبلغ خرید به صورت ریالی به موجودی حساب شما اضاقه خواهد شد.
"""

ONLINE_PAYMENT_IS_DISABLED = """
پرداخت آنلاین به صورت موقت غیرفعال است، لطفا از روش کارت به کارت استفاده نمایید.
"""

BUY_NEW_SERVICE_CONFIRMATION = """
 ✴️ شما در حال خرید<b> {} به مبلغ {} تومان </b> هستید.
 
 ✅ در صورت تایید این مبلغ از موجودی حساب شما کسر خواهد شد و سرویس بالا فعال/رزرو خواهد شد.
"""

BUY_NEW_SERVICE_FINAL = """
 ✅ سفارش شما با شناسه <code>{}</code> با موفقیت ثبت شد.

✴️ تا لحظاتی دیگر این سرویس فعال خواهد شد و از طریق منوی سرویس های من می توانید به سرویس دسترسی داشته باشید.
"""

RECHARGE_SERVICE_FINAL = """
 ✅ سفارش شما با شناسه <code>{}</code> با موفقیت ثبت شد.

✴️ پس از اتمام سرویس فعلی، این سرویس برای شما فعال خواهد شد.
"""

NEW_ORDER_ADMIN_ALERT = """
#خرید_جدید
شناسه سفارش: <code>{}</code>
آیدی کاربر: <code>{}</code>
کاربر: <a href="tg://user?id={}">{}</a>

<b> خرید  {} </b>
"""

NEW_ORDER_MAX_OPEN_ORDERS = """
شما {total} سفارش در وضعیت باز دارید،
قبل از درج سفارش جدید باید سفارش قبلی خود را پرداخت یا لغو نمایید.

"""


NEW_ORDER_NO_ENOUGH_BALANCE = """
⚠️موجودی حساب شما کافی نمی باشد.

ابتدا از منوی افزایش موجودی، میزان موجودی حساب خود را افزایش دهید.

موجودی حساب شما: {balance} تومان
"""

GET_TEST_SERVICE_ADMIN_ALERT = """
#سرویس_تستی_جدید
کاربر: <a href="tg://user?id={chat_id}">{full_name}</a>
<b> .یک سرویس تستی جدید ایجاد شد </b>
"""

GET_TEST_SERVICE_ERROR_ADMIN_ALERT = """
#سرویس_تستی_جدید

کاربر: <a href="tg://user?id={chat_id}">{full_name}</a>
<b>⚠️ خطا در ایجاد سرویس تستی جدید
</b>
"""

GET_TEST_SERVICE_NOT_ALLOWED = """
⚠️ کاربر گرامی، بدلیل دریافت سرویس رایگان تست در {day} روز گذشته، در حال حاضر مجاز به دریافت سرویس تستی جدید نیستید.
 
️ می توانید از قسمت <b>🛍 خرید سرویس</b> اقدام به خرید سرویس نمایید یا از طریق منوی <b>💎 سرویس های من</b> می توانید به سرویس تستی خود دسترسی داشته باشید.
"""

GET_TEST_SERVICE_SUCCESS = """
✅ سرویس رایگان تست با موفقیت ایجاد شد.

✴️ تا دقایقی دیگر از طریق منوی <b>💎 سرویس های من</b> می توانید به سرویس رایگان تست دسترسی داشته باشید.

❇️ همچنین از منوی راهنما می توانید راهنمای اتصال مربوط به دستگاه خود را مشاهده نمایید و بر اساس کلیپ های آموزشی متصل شوید.

<b>قبلا از بروز بودن تمامی نرم افزار های دستگاه خود و سرعت اینترنت مطمئن شوید.</b>
"""

ADMIN_NOTIFICATION_USER_EXPIRED = """
اکانت با ایمیل {email} بدلیل {due} به مالکیت {user_markup} منقضی شد.

<a href="https://t.me/{telegram_user_name}">{full_name}</a>

"""

USER_NOTIFICATION_ACCOUNT_EXPIRED = """
سرویس شما با شناسه {id} بدلیل {due} منقضی شد.

✴️ جهت تمدید سرویس می توانید از طریق منوی<b> 🛍 خرید سرویس</b> اقدام نمایید.
"""

ADMIN_NOTIFICATION = """
Send Notification to {user_detail}:
Type: #{type}
Message:
{message}
"""

USED_TRAFFIC_NOTIFICATION = """
⚠️ شما تا این لحظه بیش از {used_traffic_percent} درصد از ترافیک سرویس یا شناسه {account_email} را مصرف نموده اید.

✳️ جهت مشاهده میزان ترافیک مصرفی و همچنین تاریخ انقضا سرویس، به منوی <b>💎 سرویس های من</b> مراجعه نمایید.

✴️ جهت افزایش موجودی حتما از طریق منوی <b> 💰 افزایش موجودی</b> اقدام نمایید.

✴️ جهت تمدید سرویس می توانید از طریق منوی<b> 🛍 خرید سرویس</b> اقدام نمایید.
"""

EXPIRE_TIME_NOTIFICATION = """
⚠️ کمتر از {days} روز دیگر زمان اعتبار سرویس شما با شناسه {account_email} به پایان می رسد.

✳️ جهت مشاهده میزان ترافیک مصرفی و همچنین تاریخ انقضا سرویس، به منوی <b>💎 سرویس های من</b> مراجعه نمایید.

✴️ جهت تمدید سرویس می توانید از طریق منوی<b> 🛍 خرید سرویس</b> اقدام نمایید.

✴️ جهت افزایش موجودی حتما از طریق منوی <b> 💰 افزایش موجودی</b> اقدام نمایید.
"""

PLEASE_ENTER_NEW_SERVICE_NAME = """
لطفا یک نام جدید برای سرویس وارد نمایید:
"""

CHANGE_SERVICE_NAME_SUCCESS = """
نام سرویس شما با موفقیت تغییر یافت.
"""


GET_PAYMENT_RECEIPT_MESSAGE = """
✴️ لطفا فقط تصویر رسید پرداختی را ارسال نمایید
"""


GET_PAYMENT_RECEIPT_SUCCESS = """
✅ رسید پرداختی شما با موفقیت دریافت شد، پس از بررسی موجودی شما افرایش خواهد یافت.
"""

GET_PAYMENT_RECEIPT_ERROR = """
لطفا مجددا رسید را ارسال نمایید.
"""

PAYMENT_RECEIPT_DETAIL = """
#RECEIPT
Chat ID: `{chat_id}`
Name: {full_name}
User Name: {username}
User Caption: {caption}
"""
