REGIATER_SUCCESS = """
درخواست شما برای ایجاد حساب کاربری با موفقیت ثبت شد 🎉

در صورت پرداخت هزینه اشتراک ماهیانه 🎁 اکانت اختصاصی شما از همین طریق برای شما ارسال خواهد شد 🍻
"""
REGISTER_ADMIN_ALERT = """
{} with Chat ID <code>{}</code> has requested to create a VPN user acoount.
"""
WELCOME_MESSAGE = """
سلام {} عزیز 👋

از طریق این ربات می توانید در هر لحظه اقدام به خرید سرویس VPN جدید نمایید.

همچنین از طریق منوی زیر می توانید به اطلاعات پروفایل و وضعیت سرویس های خریداری شده خود دسترسی داشته باشید.

در صورت داشتن هرگونه پرسشی از لینک زیر جهت ارتباط با ادمین استفاده نمایید.

💬 [ارتباط با ادمین](https://t.me/{})

"""

MY_ACCOUNT_MESSAGE = """
✅ وضعیت: {}
 شناسه: {}

⏫ آپلود↑ : {}
⏬ دانلود↓ : {}

مجموع حجم مصرف شده تاکنون : {}

⭕ کل حجم اکانت : {}

⏰ تاریخ اعتبار : {}

⚠️ از ارسال این لینک در پیامک یا پیام رسان های داخلی خودداری نمایید، زیرا باعث غیرفعال شدن اکانت شما خواهد شد.

روی متن زیر کلیک نمایید تا لینک اشتراک پروفایل شما در کلیپ بورد کپی شود: 
 
 <code>{}?uuid={}</code>
"""
